# Гайд по бронированию SRT

## Что умеет этот сценарий

- Искать поезда SRT из Сусо.
- Проверять доступность мест.
- Оформлять бронь.
- Показывать текущие бронирования.
- Отменять бронь.

## Что нужно заранее

- Python 3.10+
- `python3 -m pip install SRTrain`
- Прочитать [общую настройку](../setup.md)
- Прочитать [политику по секретам](../security-and-secrets.md)

## Нужные переменные окружения

- `KSKILL_SRT_ID`
- `KSKILL_SRT_PASSWORD`

### Порядок разрешения учётных данных

1. Если переменные уже есть в окружении, использовать их.
2. Если агент использует отдельный secret vault, можно брать секреты оттуда.
3. Если env нет, сначала искать значения в `~/.config/ru-skill/secrets.env`, затем в `~/.config/k-skill/secrets.env`.
4. Если данных нет вообще, запросить их у пользователя и сохранить в vault или `secrets.env`.

## Входные данные

- Станция отправления
- Станция прибытия
- Дата: `YYYYMMDD`
- Желаемое время старта: `HHMMSS`
- Количество пассажиров
- Предпочтение по местам

## Базовый поток

1. Если `SRTrain` не установлен, сначала поставить пакет.
2. Если `KSKILL_SRT_ID` и `KSKILL_SRT_PASSWORD` не заданы, получить их через описанный порядок разрешения.
3. Сначала выполнить поиск поездов.
4. Показать время отправления и прибытия, наличие мест и цену.
5. Переходить к бронированию только после выбора конкретного поезда.
6. Для просмотра и отмены заново идентифицировать нужную бронь.

## Пример

```bash
python3 - <<'PY'
import os
from SRT import SRT

srt = SRT(os.environ["KSKILL_SRT_ID"], os.environ["KSKILL_SRT_PASSWORD"])
trains = srt.search_train("수서", "부산", "20260328", "080000", time_limit="120000")

for idx, train in enumerate(trains[:5], start=1):
    print(idx, train)
PY
```

## Ограничения

- Секреты нужно передавать через env, vault или поддерживаемые `secrets.env` файлы.
- Этот документ не покрывает оплату после бронирования.
- Не нужно строить агрессивные бесконечные циклы повторных попыток при полном sold out.
