# Гайд по поиску почтового индекса

## Что умеет этот сценарий

- Искать официальный почтовый индекс по адресу через ePost.
- Сравнивать верхние кандидаты, если по одной улице или зданию приходит несколько строк.
- Быстро корректировать поисковую фразу, если результатов нет.

## Что нужно заранее

- Доступ в интернет
- `curl`
- Необязательно: `python3`

## Входные данные

- Адресный запрос
  - Например: `세종대로 209`
  - Например: `판교역로 235`

## Базовый поток

1. Сначала обращаться к официальному поиску ePost, а не к неофициальным картам или блогам.
2. Передавать адрес в параметр `keyword` и получать HTML-страницу.
3. Извлекать из ответа `sch_zipcode`, `sch_address1` и `sch_bdNm`.
4. Если есть несколько кандидатов, показывать только верхние 3-5 строк.
5. Если соединение рвётся или истекает timeout, повторить запрос с теми же `curl` retry-флагами; затем при необходимости уточнять запрос от `짧은 도로명 + 건물번호` к `시/군/구 포함 전체 주소`.

## Пример

```bash
python3 - <<'PY'
import html
import re
import subprocess

query = "세종대로 209"
cmd = [
    "curl",
    "--http1.1",
    "--tls-max",
    "1.2",
    "--silent",
    "--show-error",
    "--location",
    "--retry",
    "3",
    "--retry-all-errors",
    "--retry-delay",
    "1",
    "--max-time",
    "20",
    "--get",
    "--data-urlencode",
    f"keyword={query}",
    "https://parcel.epost.go.kr/parcel/comm/zipcode/comm_newzipcd_list.jsp",
]
result = subprocess.run(
    cmd,
    check=True,
    capture_output=True,
    text=True,
    encoding="utf-8",
)
page = result.stdout

matches = re.findall(
    r'name="sch_zipcode"\s+value="([^"]+)".*?name="sch_address1"\s+value="([^"]+)".*?name="sch_bdNm"\s+value="([^"]*)"',
    page,
    re.S,
)

if not matches:
    raise SystemExit("검색 결과가 없습니다.")

for zip_code, address, building in matches[:5]:
    suffix = f" ({building})" if building else ""
    print(f"{zip_code}\t{html.unescape(address)}{suffix}")
PY
```

## Практические советы

- В shell-обвязке или агентной среде безопаснее сначала сохранить HTML во временный файл: `mktemp`, `임시 파일`.
- Если делать `curl ... | head`, можно спровоцировать `curl: (23)` из-за преждевременного закрытия downstream; лучше писать полный ответ во временный файл.
- Обычно лучше уточнять запрос в таком порядке: `짧은 도로명 + 건물번호` -> `시/군/구 포함 전체 주소` -> запись по кварталу или участку.

## Ограничения протокола и клиента

`프로토콜/클라이언트 제약` остаются теми же и после русификации.

- У текущего ePost endpoint'а нативный `urllib` иногда ломается на TLS/HTTP negotiation и получает reset.
- Даже с `curl` возможны редкие timeout/reset, поэтому базовый пример включает `--retry 3 --retry-all-errors --retry-delay 1`.
- В документации рекомендуется путь `curl --http1.1 --tls-max 1.2`, а Python используется только для парсинга.
- Общий timeout лучше контролировать через `curl` (`--max-time` и `--retry`), а не внешним Python timeout. Иными словами, важны именно `` `curl` 자체 제한 `` и его retry-механика.
- Если выбирается другой клиент, сначала нужно убедиться, что он стабильно получает ответ по HTTP/1.1 + TLS 1.2, и только потом вешать парсер.

## Ограничения

- Для одного адреса может быть несколько строк из-за названия здания, поэтому не стоит автоматически брать первую.
- Если результатов слишком много, нужно добавить в запрос город или район.
- Это read-only навык, значит адресные данные не нужно хранить.
